{"1":{"Id":"1","Name":"Chicken Tikka Marsala","Introduction":"This dish is best when prepared with whole-milk yogurt, but low-fat yogurt can be substituted. For a spicier dish, do not remove the ribs and seeds from the chile. If you prefer, substitute 2 teaspoons ground coriander, 1/4 teaspoon ground cardamom, 1/4 teaspoon ground cinnamon, and 1/2 teaspoon ground black pepper for the garam masala. The sauce can be made ahead, refrigerated for up to 4 days in an airtight container, and gently reheated before adding the hot chicken. Serve with basmati rice.","Ingredients":[{"Ingredient":{"Id":"1","Name":"Ground Cumin","Description":""},"Amount":0.5,"Unit":0,"Notes":""},{"Ingredient":{"Id":"2","Name":"Ground Coriander","Description":""},"Amount":0.5,"Unit":0,"Notes":""},{"Ingredient":{"Id":"3","Name":"Cayene Pepper","Description":""},"Amount":0.25,"Unit":0,"Notes":""},{"Ingredient":{"Id":"4","Name":"Table Salt","Description":""},"Amount":1.0,"Unit":0,"Notes":""},{"Ingredient":{"Id":"5","Name":"Chicken Breast, Skinless, Boneless","Description":""},"Amount":2.0,"Unit":2,"Notes":"trimmed of fat"},{"Ingredient":{"Id":"6","Name":"Plain Whole Milk Yogurt","Description":""},"Amount":1.0,"Unit":3,"Notes":""}],"Steps":[{"Number":1,"Description":"FOR THE CHICKEN: Combine cumin, coriander, cayenne, and salt in small bowl. Sprinkle both sides of chicken with spice mixture, pressing gently so mixture adheres. Place chicken on plate, cover with plastic wrap, and refrigerate for 30 to 60 minutes. In large bowl, whisk together yogurt, oil, garlic, and ginger; set aside."},{"Number":2,"Description":"FOR THE SAUCE: Heat oil in large Dutch oven over medium heat until shimmering. Add onion and cook, stirring frequently, until light golden, 8 to 10 minutes. Add garlic, ginger, chile, tomato paste, and garam masala; cook, stirring frequently, until fragrant, about 3 minutes. Add crushed tomatoes, sugar, and salt; bring to boil. Reduce heat to medium-low, cover, and simmer for 15 minutes, stirring occasionally. Stir in cream and return to simmer. Remove pan from heat and cover to keep warm."},{"Number":3,"Description":"While sauce simmers, adjust oven rack to upper-middle position (about 6 inches from heating element) and heat broiler. Using tongs, dip chicken into yogurt mixture (chicken should be coated with thick layer of yogurt) and arrange on wire rack set in foil-lined rimmed baking sheet or broiler pan. Discard excess yogurt mixture. Broil chicken until thickest parts register 160 degrees on instant-read thermometer and exterior is lightly charred in spots, 10 to 18 minutes, flipping chicken halfway through cooking."},{"Number":4,"Description":"Let chicken rest 5 minutes, then cut into 1-inch chunks and stir into warm sauce (do not simmer chicken in sauce). Stir in cilantro, adjust seasoning with salt, and serve."}]}}